###################################################################

# Created by write_sdc on Sun Feb 26 12:59:07 2023

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clka]
set_driving_cell -lib_cell INVX1 [get_ports clkb]
set_driving_cell -lib_cell INVX1 [get_ports we_insmem]
set_driving_cell -lib_cell INVX1 [get_ports {pc[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {pc[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {pc[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {pc[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {pc[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {pc[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {instruction_in[0]}]
create_clock [get_ports clka]  -period 50  -waveform {0 25}
set_input_delay -clock clka  1  [get_ports clkb]
set_input_delay -clock clka  1  [get_ports we_insmem]
set_input_delay -clock clka  1  [get_ports {pc[5]}]
set_input_delay -clock clka  1  [get_ports {pc[4]}]
set_input_delay -clock clka  1  [get_ports {pc[3]}]
set_input_delay -clock clka  1  [get_ports {pc[2]}]
set_input_delay -clock clka  1  [get_ports {pc[1]}]
set_input_delay -clock clka  1  [get_ports {pc[0]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[15]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[14]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[13]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[12]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[11]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[10]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[9]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[8]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[7]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[6]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[5]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[4]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[3]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[2]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[1]}]
set_input_delay -clock clka  1  [get_ports {instruction_in[0]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[15]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[14]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[13]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[12]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[11]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[10]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[9]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[8]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[7]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[6]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[5]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[4]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[3]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[2]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[1]}]
set_output_delay -clock clka  1  [get_ports {instruction_out[0]}]
